results/SUDARSUN-PAPER-LOCAL-Sep16-CLEMSON-PREDICT/YCSB/ycsbwkldf/4/OSonly.out
ENABLE_FILE_STATS in con
ENABLE_FILE_STATS in per_thread_ds
ENABLE_FILE_STATS in per_thread_ds
ENABLE_FILE_STATS in per_thread_ds
[...]
RocksDB:    version 5.4
Date:       Thu Sep 22 05:10:20 2022
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
ENABLE_FILE_STATS in per_thread_ds
ENABLE_FILE_STATS in per_thread_ds
ENABLE_FILE_STATS in per_thread_ds
[...]
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    10000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    39253.2 MB (estimated)
FileSize:   19722.0 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [DATA/]
ycsbwkldf    :      16.006 micros/op 62474 ops/sec; ( reads:81320 writes:80679 total:10000000 found:81320)
DESTRUCTOR GETTING CALLED 
PRINT_GLOBAL_STATS in dest
PRINT_GLOBAL_LIB_STATS in dest
Total nr_ra = 0
Total nr_bytes_ra = 0